app/controllers/notes_controller.rb

INSERT INTO "notes" ("title", "description", "created_at", "updated_at", "publish") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "testss"], ["description", "dfasdfasdfasdfasdfasdf"], ["created_at", "2024-04-27 12:59:16.820329"], ["updated_at", "2024-04-27 12:59:16.820329"], ["publish", nil]]
---
  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save

UPDATE "notes" SET "title" = ?, "updated_at" = ?, "publish" = ? WHERE "notes"."id" = ?  [["title", "(EDit) An Introduction to Abstract Data Types in JavaScript"], ["updated_at", "2024-04-27 14:59:05.864082"], ["publish", 1], ["id", 19]]
---
  def update
    respond_to do |format|
      if @note.update(note_params)

DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]
---
  def destroy
    @note.destroy!